; RUN: opt < %s -passes="print<mem-usedef-analysis-local>" -disable-output 2>&1 | FileCheck %s 

; CHECK-DAG: Use::nx At:: mg.c:199 Defined at: mg.c:190, 
; CHECK-DAG: Use::lt At:: mg.c:199 Defined at: mg.c:188, 
; CHECK-DAG: Use::nz At:: mg.c:199 Defined at: mg.c:192, 
; CHECK-DAG: Use::lt At:: mg.c:264 Defined at: mg.c:188, 
; CHECK-DAG: Use::nx At:: mg.c:205 Defined at: mg.c:190, 
; CHECK-DAG: Use::lt At:: mg.c:190 Defined at: mg.c:188, 
; CHECK-DAG: Use::ny At:: mg.c:199 Defined at: mg.c:191, 
; CHECK-DAG: Use::lt At:: mg.c:199 Defined at: mg.c:188, 
; CHECK-DAG: Use::lt At:: mg.c:199 Defined at: mg.c:188, 
; CHECK-DAG: Use::lt At:: mg.c:191 Defined at: mg.c:188, 
; CHECK-DAG: Use::lt At:: mg.c:192 Defined at: mg.c:188, 
; CHECK-DAG: Use::nx At:: mg.c:199 Defined at: mg.c:190, 
; CHECK-DAG: Use::lt At:: mg.c:199 Defined at: mg.c:188, 
; CHECK-DAG: Use::ny At:: mg.c:264 Defined at: mg.c:191, 
; CHECK-DAG: Use::lt At:: mg.c:264 Defined at: mg.c:188, 
; CHECK-DAG: Use::nz At:: mg.c:264 Defined at: mg.c:192, 
; CHECK-DAG: Use::Class At:: mg.c:327 Defined at: mg.c:204, mg.c:200, mg.c:202, mg.c:206, mg.c:208, mg.c:210, mg.c:212, mg.c:214, mg.c:216, 
; CHECK-DAG: Use::Class At:: mg.c:329 Defined at: mg.c:204, mg.c:200, mg.c:202, mg.c:206, mg.c:208, mg.c:210, mg.c:212, mg.c:214, mg.c:216, 
; CHECK-DAG: Use::lt At:: mg.c:201 Defined at: mg.c:188, 
; CHECK-DAG: Use::nx At:: mg.c:201 Defined at: mg.c:190, 
; CHECK-DAG: Use::nit At:: mg.c:201 Defined at: mg.c:189, 

!69 = distinct !DIGlobalVariable(name: "z1", scope: !70, file: !3, line: 914, type: !12, isLocal: true, isDefinition: true)
!70 = distinct !DISubprogram(name: "interp", scope: !3, file: !3, line: 900, type: !71, scopeLine: 902, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !73)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !12, !15, !15, !15, !12, !15, !15, !15, !15}
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!74 = !DILocalVariable(name: "oz", arg: 1, scope: !70, file: !3, line: 900, type: !12)
!75 = !DILocalVariable(name: "mm1", arg: 2, scope: !70, file: !3, line: 900, type: !15)
!76 = !DILocalVariable(name: "mm2", arg: 3, scope: !70, file: !3, line: 900, type: !15)
!77 = !DILocalVariable(name: "mm3", arg: 4, scope: !70, file: !3, line: 900, type: !15)
!78 = !DILocalVariable(name: "ou", arg: 5, scope: !70, file: !3, line: 901, type: !12)
!79 = !DILocalVariable(name: "n1", arg: 6, scope: !70, file: !3, line: 901, type: !15)
!80 = !DILocalVariable(name: "n2", arg: 7, scope: !70, file: !3, line: 901, type: !15)
!81 = !DILocalVariable(name: "n3", arg: 8, scope: !70, file: !3, line: 901, type: !15)
!82 = !DILocalVariable(name: "k", arg: 9, scope: !70, file: !3, line: 901, type: !15)
!83 = !DILocalVariable(name: "i3", scope: !70, file: !3, line: 907, type: !15)
!84 = !DILocalVariable(name: "i2", scope: !70, file: !3, line: 907, type: !15)
!85 = !DILocalVariable(name: "i1", scope: !70, file: !3, line: 907, type: !15)
!86 = !DILocalVariable(name: "d1", scope: !70, file: !3, line: 907, type: !15)
!87 = !DILocalVariable(name: "d2", scope: !70, file: !3, line: 907, type: !15)
!88 = !DILocalVariable(name: "d3", scope: !70, file: !3, line: 907, type: !15)
!89 = !DILocalVariable(name: "t1", scope: !70, file: !3, line: 907, type: !15)
!90 = !DILocalVariable(name: "t2", scope: !70, file: !3, line: 907, type: !15)
!91 = !DILocalVariable(name: "t3", scope: !70, file: !3, line: 907, type: !15)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "z2", scope: !70, file: !3, line: 914, type: !12, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "z3", scope: !70, file: !3, line: 914, type: !12, isLocal: true, isDefinition: true)
!96 = !{i32 2, !"Dwarf Version", i32 4}
!97 = !{i32 2, !"Debug Info Version", i32 3}
!98 = !{i32 1, !"wchar_size", i32 4}
!99 = !{!"clang version 9.0.0 (git@github.com:prithayan/llvm-project.git 9683f06d0ed55984d96f430331d28b1437b7dd07)"}
!100 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 120, type: !101, scopeLine: 121, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !103)
!101 = !DISubroutineType(types: !102)
!102 = !{!15}
!103 = !{!104, !105, !106, !107, !108, !109, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !131, !132, !192}
!104 = !DILocalVariable(name: "k", scope: !100, file: !3, line: 129, type: !15)
!105 = !DILocalVariable(name: "it", scope: !100, file: !3, line: 129, type: !15)
!106 = !DILocalVariable(name: "t", scope: !100, file: !3, line: 130, type: !13)
!107 = !DILocalVariable(name: "tinit", scope: !100, file: !3, line: 130, type: !13)
!108 = !DILocalVariable(name: "mflops", scope: !100, file: !3, line: 130, type: !13)
!109 = !DILocalVariable(name: "a", scope: !100, file: !3, line: 132, type: !110)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 256, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 4)
!113 = !DILocalVariable(name: "c", scope: !100, file: !3, line: 132, type: !110)
!114 = !DILocalVariable(name: "rnm2", scope: !100, file: !3, line: 134, type: !13)
!115 = !DILocalVariable(name: "rnmu", scope: !100, file: !3, line: 134, type: !13)
!116 = !DILocalVariable(name: "old2", scope: !100, file: !3, line: 134, type: !13)
!117 = !DILocalVariable(name: "oldu", scope: !100, file: !3, line: 134, type: !13)
!118 = !DILocalVariable(name: "epsilon", scope: !100, file: !3, line: 134, type: !13)
!119 = !DILocalVariable(name: "n1", scope: !100, file: !3, line: 135, type: !15)
!120 = !DILocalVariable(name: "n2", scope: !100, file: !3, line: 135, type: !15)
!121 = !DILocalVariable(name: "n3", scope: !100, file: !3, line: 135, type: !15)
!122 = !DILocalVariable(name: "nit", scope: !100, file: !3, line: 135, type: !15)
!123 = !DILocalVariable(name: "nn", scope: !100, file: !3, line: 136, type: !13)
!124 = !DILocalVariable(name: "verify_value", scope: !100, file: !3, line: 136, type: !13)
!125 = !DILocalVariable(name: "err", scope: !100, file: !3, line: 136, type: !13)
!126 = !DILocalVariable(name: "verified", scope: !100, file: !3, line: 137, type: !41)
!127 = !DILocalVariable(name: "i", scope: !100, file: !3, line: 139, type: !15)
!128 = !DILocalVariable(name: "t_names", scope: !100, file: !3, line: 140, type: !129)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 640, elements: !21)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!131 = !DILocalVariable(name: "tmax", scope: !100, file: !3, line: 141, type: !13)
!132 = !DILocalVariable(name: "fp", scope: !100, file: !3, line: 154, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !135, line: 48, baseType: !136)
!135 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !137, line: 241, size: 1728, elements: !138)
!137 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !159, !160, !161, !162, !166, !168, !170, !174, !177, !179, !180, !181, !182, !183, !187, !188}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !136, file: !137, line: 242, baseType: !15, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !136, file: !137, line: 247, baseType: !130, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !136, file: !137, line: 248, baseType: !130, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !136, file: !137, line: 249, baseType: !130, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !136, file: !137, line: 250, baseType: !130, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !136, file: !137, line: 251, baseType: !130, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !136, file: !137, line: 252, baseType: !130, size: 64, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !136, file: !137, line: 253, baseType: !130, size: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !136, file: !137, line: 254, baseType: !130, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !136, file: !137, line: 256, baseType: !130, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !136, file: !137, line: 257, baseType: !130, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !136, file: !137, line: 258, baseType: !130, size: 64, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !136, file: !137, line: 260, baseType: !152, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !137, line: 156, size: 192, elements: !154)
!154 = !{!155, !156, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !153, file: !137, line: 157, baseType: !152, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !153, file: !137, line: 158, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !153, file: !137, line: 162, baseType: !15, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !136, file: !137, line: 262, baseType: !157, size: 64, offset: 832)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !136, file: !137, line: 264, baseType: !15, size: 32, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !136, file: !137, line: 268, baseType: !15, size: 32, offset: 928)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !136, file: !137, line: 270, baseType: !163, size: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !164, line: 131, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!165 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !136, file: !137, line: 274, baseType: !167, size: 16, offset: 1024)
!167 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !136, file: !137, line: 275, baseType: !169, size: 8, offset: 1040)
!169 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !136, file: !137, line: 276, baseType: !171, size: 8, offset: 1048)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !136, file: !137, line: 280, baseType: !175, size: 64, offset: 1088)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !137, line: 150, baseType: null)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !136, file: !137, line: 289, baseType: !178, size: 64, offset: 1152)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !164, line: 132, baseType: !165)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !136, file: !137, line: 297, baseType: !14, size: 64, offset: 1216)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !136, file: !137, line: 298, baseType: !14, size: 64, offset: 1280)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !136, file: !137, line: 299, baseType: !14, size: 64, offset: 1344)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !136, file: !137, line: 300, baseType: !14, size: 64, offset: 1408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !136, file: !137, line: 302, baseType: !184, size: 64, offset: 1472)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 46, baseType: !186)
!185 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.0/include/stddef.h", directory: "")
!186 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !136, file: !137, line: 303, baseType: !15, size: 32, offset: 1536)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !136, file: !137, line: 305, baseType: !189, size: 160, offset: 1568)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 20)
!192 = !DILocalVariable(name: "result", scope: !193, file: !3, line: 174, type: !15)
!193 = distinct !DILexicalBlock(scope: !194, file: !3, line: 173, column: 46)
!194 = distinct !DILexicalBlock(scope: !100, file: !3, line: 173, column: 7)
!195 = !DILocation(line: 122, column: 17, scope: !100)
!196 = !DILocation(line: 122, column: 7, scope: !100)
!197 = !DILocation(line: 122, column: 5, scope: !100)
!198 = !{!199, !199, i64 0}
!199 = !{!"any pointer", !200, i64 0}
!200 = !{!"omnipotent char", !201, i64 0}
!201 = !{!"Simple C/C++ TBAA"}
!202 = !DILocation(line: 123, column: 17, scope: !100)
!203 = !DILocation(line: 123, column: 7, scope: !100)
!204 = !DILocation(line: 123, column: 5, scope: !100)
!205 = !DILocation(line: 124, column: 17, scope: !100)
!206 = !DILocation(line: 124, column: 7, scope: !100)
!207 = !DILocation(line: 124, column: 5, scope: !100)
!208 = !DILocation(line: 132, column: 3, scope: !100)
!209 = !DILocation(line: 132, column: 10, scope: !100)
!210 = !DILocation(line: 132, column: 16, scope: !100)
!211 = !DILocation(line: 134, column: 3, scope: !100)
!212 = !DILocation(line: 134, column: 10, scope: !100)
!213 = !DILocation(line: 134, column: 16, scope: !100)
!214 = !DILocation(line: 135, column: 3, scope: !100)
!215 = !DILocation(line: 135, column: 7, scope: !100)
!216 = !DILocation(line: 135, column: 11, scope: !100)
!217 = !DILocation(line: 135, column: 15, scope: !100)
!218 = !DILocation(line: 135, column: 19, scope: !100)
!219 = !DILocation(line: 140, column: 3, scope: !100)
!220 = !DILocation(line: 140, column: 9, scope: !100)
!221 = !DILocation(line: 0, scope: !100)
!222 = !DILocation(line: 143, column: 8, scope: !223)
!223 = distinct !DILexicalBlock(scope: !100, file: !3, line: 143, column: 3)
!224 = !DILocation(line: 0, scope: !223)
!225 = !DILocation(line: 143, column: 22, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !3, line: 143, column: 3)
!227 = !DILocation(line: 143, column: 3, scope: !223)
!228 = !DILocation(line: 144, column: 5, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !3, line: 143, column: 37)
!230 = !DILocation(line: 145, column: 3, scope: !229)
!231 = !DILocation(line: 143, column: 33, scope: !226)
!232 = !DILocation(line: 143, column: 3, scope: !226)
!233 = distinct !{!233, !227, !234}
!234 = !DILocation(line: 145, column: 3, scope: !223)
!235 = !DILocation(line: 149, column: 3, scope: !100)
!236 = !DILocation(line: 155, column: 13, scope: !237)
!237 = distinct !DILexicalBlock(scope: !100, file: !3, line: 155, column: 7)
!238 = !DILocation(line: 155, column: 39, scope: !237)
!239 = !DILocation(line: 155, column: 7, scope: !100)
!240 = !DILocation(line: 156, column: 13, scope: !241)
!241 = distinct !DILexicalBlock(scope: !237, file: !3, line: 155, column: 48)
!242 = !{!200, !200, i64 0}
!243 = !DILocation(line: 157, column: 5, scope: !241)
!244 = !DILocation(line: 157, column: 21, scope: !241)
!245 = !DILocation(line: 158, column: 5, scope: !241)
!246 = !DILocation(line: 158, column: 22, scope: !241)
!247 = !DILocation(line: 159, column: 5, scope: !241)
!248 = !DILocation(line: 159, column: 21, scope: !241)
!249 = !DILocation(line: 160, column: 5, scope: !241)
!250 = !DILocation(line: 160, column: 22, scope: !241)
!251 = !DILocation(line: 161, column: 5, scope: !241)
!252 = !DILocation(line: 161, column: 22, scope: !241)
!253 = !DILocation(line: 162, column: 5, scope: !241)
!254 = !DILocation(line: 162, column: 22, scope: !241)
!255 = !DILocation(line: 163, column: 5, scope: !241)
!256 = !DILocation(line: 163, column: 23, scope: !241)
!257 = !DILocation(line: 164, column: 5, scope: !241)
!258 = !DILocation(line: 164, column: 22, scope: !241)
!259 = !DILocation(line: 165, column: 5, scope: !241)
