; RUN: opt < %s -passes="print<mem-usedef-analysis-local>" -disable-output 2>&1 | FileCheck %s 

; CHECK-DAG: Use::trecs At:: lu.c:334 Defined at: lu.c:326, 
; CHECK-DAG: Use::timeron At:: lu.c:324 Defined at: lu.c:224, lu.c:238, 
; CHECK-DAG: Use::trecs At:: lu.c:334 Defined at: lu.c:326, 
; CHECK-DAG: Use::trecs At:: lu.c:336 Defined at: lu.c:326, 
; CHECK-DAG: Use::trecs At:: lu.c:336 Defined at: lu.c:326, 
; CHECK-DAG: Use::trecs At:: lu.c:336 Defined at: lu.c:326, 
; CHECK-DAG: Use::trecs At:: lu.c:338 Defined at: lu.c:326, 

; ModuleID = 'omp-host.ll'
source_filename = "lu.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [11 x i8] c"timer.flag\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@timeron = common dso_local global i32 0, align 4, !dbg !0
@.str.2 = private unnamed_addr constant [6 x i8] c"total\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"rhsx\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"rhsy\00", align 1
@.str.5 = private unnamed_addr constant [5 x i8] c"rhsz\00", align 1

!159 = distinct !DIGlobalVariable(name: "d", scope: !2, file: !3, line: 137, type: !151, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "np", scope: !2, file: !3, line: 139, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 5984, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 187)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "indxp", scope: !2, file: !3, line: 140, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 18382848, elements: !168)
!168 = !{!164, !169}
!169 = !DISubrange(count: 3072)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "jndxp", scope: !2, file: !3, line: 141, type: !167, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "tmat", scope: !2, file: !3, line: 142, type: !174, isLocal: false, isDefinition: true)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4915200, elements: !175)
!175 = !{!108, !108, !169}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "tv", scope: !2, file: !3, line: 143, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 983040, elements: !179)
!179 = !{!108, !169}
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "utmp_G", scope: !2, file: !3, line: 144, type: !182, isLocal: false, isDefinition: true)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 100663296, elements: !183)
!183 = !{!184, !109, !109, !109}
!184 = !DISubrange(count: 6)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "rtmp_G", scope: !2, file: !3, line: 145, type: !117, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "ce", scope: !2, file: !3, line: 151, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 4160, elements: !190)
!190 = !{!108, !191}
!191 = !DISubrange(count: 13)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "maxtime", scope: !2, file: !3, line: 158, type: !13, isLocal: false, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "logical", file: !6, line: 4, baseType: !5)
!195 = !{i32 2, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{i32 1, !"wchar_size", i32 4}
!198 = !{!"clang version 9.0.0 (git@github.com:prithayan/llvm-project.git 9683f06d0ed55984d96f430331d28b1437b7dd07)"}
!199 = distinct !DISubprogram(name: "omp_device_mem_init", scope: !3, file: !3, line: 165, type: !200, scopeLine: 165, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !202)
!200 = !DISubroutineType(types: !201)
!201 = !{null}
!202 = !{}
!203 = !DILocation(line: 185, column: 1, scope: !199)
!204 = distinct !DISubprogram(name: "omp_device_mem_delete", scope: !3, file: !3, line: 187, type: !200, scopeLine: 187, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !202)
!205 = !DILocation(line: 207, column: 1, scope: !204)
!206 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 209, type: !207, scopeLine: 210, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !212)
!207 = !DISubroutineType(types: !208)
!208 = !{!41, !41, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !224, !225, !227}
!213 = !DILocalVariable(name: "argc", arg: 1, scope: !206, file: !3, line: 209, type: !41)
!214 = !DILocalVariable(name: "argv", arg: 2, scope: !206, file: !3, line: 209, type: !209)
!215 = !DILocalVariable(name: "Class", scope: !206, file: !3, line: 211, type: !211)
!216 = !DILocalVariable(name: "verified", scope: !206, file: !3, line: 212, type: !194)
!217 = !DILocalVariable(name: "mflops", scope: !206, file: !3, line: 213, type: !13)
!218 = !DILocalVariable(name: "t", scope: !206, file: !3, line: 215, type: !13)
!219 = !DILocalVariable(name: "tmax", scope: !206, file: !3, line: 215, type: !13)
!220 = !DILocalVariable(name: "trecs", scope: !206, file: !3, line: 215, type: !221)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 768, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 12)
!224 = !DILocalVariable(name: "i", scope: !206, file: !3, line: 216, type: !41)
!225 = !DILocalVariable(name: "t_names", scope: !206, file: !3, line: 217, type: !226)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 768, elements: !222)
!227 = !DILocalVariable(name: "fp", scope: !206, file: !3, line: 222, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !230, line: 48, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !232, line: 241, size: 1728, elements: !233)
!232 = !DIFile(filename: "/usr/include/libio.h", directory: "")
!233 = !{!234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !254, !255, !256, !257, !261, !263, !265, !269, !272, !274, !275, !276, !277, !278, !282, !283}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !231, file: !232, line: 242, baseType: !41, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !231, file: !232, line: 247, baseType: !210, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !231, file: !232, line: 248, baseType: !210, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !231, file: !232, line: 249, baseType: !210, size: 64, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !231, file: !232, line: 250, baseType: !210, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !231, file: !232, line: 251, baseType: !210, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !231, file: !232, line: 252, baseType: !210, size: 64, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !231, file: !232, line: 253, baseType: !210, size: 64, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !231, file: !232, line: 254, baseType: !210, size: 64, offset: 512)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !231, file: !232, line: 256, baseType: !210, size: 64, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !231, file: !232, line: 257, baseType: !210, size: 64, offset: 640)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !231, file: !232, line: 258, baseType: !210, size: 64, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !231, file: !232, line: 260, baseType: !247, size: 64, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !232, line: 156, size: 192, elements: !249)
!249 = !{!250, !251, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !248, file: !232, line: 157, baseType: !247, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !248, file: !232, line: 158, baseType: !252, size: 64, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !248, file: !232, line: 162, baseType: !41, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !231, file: !232, line: 262, baseType: !252, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !231, file: !232, line: 264, baseType: !41, size: 32, offset: 896)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !231, file: !232, line: 268, baseType: !41, size: 32, offset: 928)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !231, file: !232, line: 270, baseType: !258, size: 64, offset: 960)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !259, line: 131, baseType: !260)
!259 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!260 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !231, file: !232, line: 274, baseType: !262, size: 16, offset: 1024)
!262 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !231, file: !232, line: 275, baseType: !264, size: 8, offset: 1040)
!264 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !231, file: !232, line: 276, baseType: !266, size: 8, offset: 1048)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 8, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 1)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !231, file: !232, line: 280, baseType: !270, size: 64, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !232, line: 150, baseType: null)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !231, file: !232, line: 289, baseType: !273, size: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !259, line: 132, baseType: !260)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !231, file: !232, line: 297, baseType: !12, size: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !231, file: !232, line: 298, baseType: !12, size: 64, offset: 1280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !231, file: !232, line: 299, baseType: !12, size: 64, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !231, file: !232, line: 300, baseType: !12, size: 64, offset: 1408)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !231, file: !232, line: 302, baseType: !279, size: 64, offset: 1472)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !280, line: 46, baseType: !281)
!280 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.0/include/stddef.h", directory: "")
!281 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !231, file: !232, line: 303, baseType: !41, size: 32, offset: 1536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !231, file: !232, line: 305, baseType: !284, size: 160, offset: 1568)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 160, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 20)
!287 = !DILocation(line: 0, scope: !206)
!288 = !DILocation(line: 211, column: 3, scope: !206)
!289 = !DILocation(line: 211, column: 8, scope: !206)
!290 = !DILocation(line: 212, column: 3, scope: !206)
!291 = !DILocation(line: 212, column: 11, scope: !206)
!292 = !DILocation(line: 215, column: 3, scope: !206)
!293 = !DILocation(line: 215, column: 19, scope: !206)
!294 = !DILocation(line: 217, column: 3, scope: !206)
!295 = !DILocation(line: 217, column: 9, scope: !206)
!296 = !DILocation(line: 223, column: 13, scope: !297)
!297 = distinct !DILexicalBlock(scope: !206, file: !3, line: 223, column: 7)
!298 = !DILocation(line: 223, column: 39, scope: !297)
!299 = !DILocation(line: 223, column: 7, scope: !206)
!300 = !DILocation(line: 224, column: 13, scope: !301)
!301 = distinct !DILexicalBlock(scope: !297, file: !3, line: 223, column: 48)
!302 = !{!303, !303, i64 0}
!303 = !{!"omnipotent char", !304, i64 0}
!304 = !{!"Simple C/C++ TBAA"}
!305 = !DILocation(line: 225, column: 5, scope: !301)
!306 = !DILocation(line: 225, column: 22, scope: !301)
!307 = !{!308, !308, i64 0}
!308 = !{!"any pointer", !303, i64 0}
!309 = !DILocation(line: 226, column: 5, scope: !301)
!310 = !DILocation(line: 226, column: 21, scope: !301)
!311 = !DILocation(line: 227, column: 5, scope: !301)
!312 = !DILocation(line: 227, column: 21, scope: !301)
!313 = !DILocation(line: 228, column: 5, scope: !301)
!314 = !DILocation(line: 228, column: 21, scope: !301)
!315 = !DILocation(line: 229, column: 5, scope: !301)
!316 = !DILocation(line: 229, column: 20, scope: !301)
!317 = !DILocation(line: 230, column: 5, scope: !301)
!318 = !DILocation(line: 230, column: 22, scope: !301)
!319 = !DILocation(line: 231, column: 5, scope: !301)
!320 = !DILocation(line: 231, column: 21, scope: !301)
!321 = !DILocation(line: 232, column: 5, scope: !301)
!322 = !DILocation(line: 232, column: 21, scope: !301)
!323 = !DILocation(line: 233, column: 5, scope: !301)
!324 = !DILocation(line: 233, column: 21, scope: !301)
!325 = !DILocation(line: 234, column: 5, scope: !301)
!326 = !DILocation(line: 234, column: 20, scope: !301)
!327 = !DILocation(line: 235, column: 5, scope: !301)
!328 = !DILocation(line: 235, column: 23, scope: !301)
!329 = !DILocation(line: 236, column: 5, scope: !301)
!330 = !DILocation(line: 237, column: 3, scope: !301)
!331 = !DILocation(line: 238, column: 13, scope: !332)
!332 = distinct !DILexicalBlock(scope: !297, file: !3, line: 237, column: 10)
!333 = !DILocation(line: 244, column: 3, scope: !206)
!334 = !DILocation(line: 248, column: 3, scope: !206)
!335 = !DILocation(line: 253, column: 3, scope: !206)
!336 = !DILocation(line: 255, column: 3, scope: !206)
!337 = !DILocation(line: 260, column: 3, scope: !206)
!338 = !DILocation(line: 265, column: 3, scope: !206)
!339 = !DILocation(line: 270, column: 3, scope: !206)
!340 = !DILocation(line: 275, column: 3, scope: !206)
!341 = !DILocation(line: 280, column: 3, scope: !206)
!342 = !DILocation(line: 281, column: 3, scope: !206)
!343 = !DILocation(line: 287, column: 8, scope: !206)
!344 = !{!345, !345, i64 0}
!345 = !{!"int", !303, i64 0}
!346 = !DILocation(line: 287, column: 3, scope: !206)
!347 = !DILocation(line: 294, column: 3, scope: !206)
!348 = !DILocation(line: 299, column: 3, scope: !206)
!349 = !DILocation(line: 301, column: 3, scope: !206)
!350 = !DILocation(line: 306, column: 26, scope: !206)
!351 = !{!352, !352, i64 0}
!352 = !{!"double", !303, i64 0}
!353 = !DILocation(line: 306, column: 3, scope: !206)
!354 = !DILocation(line: 307, column: 20, scope: !206)
!355 = !DILocation(line: 307, column: 12, scope: !206)
!356 = !DILocation(line: 307, column: 47, scope: !206)
!357 = !DILocation(line: 307, column: 39, scope: !206)
